modification des readme config et archi
